import 'package:loginui/quiz game 3/quiz-game/model/question_model.dart';

List<QuestionModel> questions = [
  QuestionModel(
    "كم تبلغ مدة لعبة مباراة كرة القدم؟ ",
    {
      "85 دقيقة.": false,
      "95 دقيقة.": false,
      "90 دقيقة.": true,
      "100 دقيقة.": false,
    },
  ),
  QuestionModel("كم يبلغ عدد اللاعبين في لعبة كرة السلة؟", {
    "سبعة.": false,
    " أربعة.": false,
    "ثمانية.": false,
    "خمسة.": true,
  }),
  QuestionModel("لأي بلد يلعب لاعب لعبة كرة القدم المسمى بليونيل ميسي؟", {
    "البرتغال.": false,
    "الأرجنتين.": true,
    "فرنسا.": false,
    "البرازيل.": false,
  }),
  QuestionModel("كم هي عدد الحلقات الموجودة في العلم الأولمبي؟", {
    "3": false,
    "6": false,
    "5": true,
    "4": false,
  }),
  QuestionModel("في أي رياضة يحمل اللاعب حقيبة؟", {
    "الغولف. ": true,
    "السلة.": false,
    "التنس.": false,
    "القدم.": false,
  }),
  QuestionModel("كم يبلغ عدد الأهداف التي يتم تسجيلها إذا كان اللاعب لديه هاتريك في اللعبة؟", {
    "اثنان.": false,
    "أربعة.": false,
    " ثلاثة.": true,
    "ستة.": false,
  }),
  QuestionModel(
      "ما هو النادي الذي فاز بأكبر عدد من ألقاب دوري أبطال أوروبا؟", {
    "برشلونة.": false,
    "فالينسيا.": false,
    "غرناطة. ": false,
    "ريال مدريد.": true,
  }),
  QuestionModel("ما هي البلد التي نشأت فيها الألعاب الأولمبية؟", {
    "ألمانيا.": false,
    "أمريكا. ": false,
    "اليونان.": true,
    "إيطاليا.": false,
  }),
  QuestionModel(
      "ما الميدالية التي يحصل عليها من في المرتبة الثالثة في ألعاب الأولمبياد؟ ",
      {
        "الذهبية.": false,
        "الكحلية.": false,
        "البرونزية.": true,
        "الفضية.": false,
      }),
  QuestionModel(
      "من هو الملاكم الأمريكي الملقب باسم الأعظم؟", {
    "كوبارت بوليف.": false,
    "محمد علي كلاي.": true,
    "لويس أورتيز.": false,
    " مايك تايسون.": false,
  }),
];
