import 'package:loginui/quiz game/quiz-game/model/question_model.dart';

List<QuestionModel> questions = [
  QuestionModel(
    "ما هو أول الأيام التي خلقها الله تعالى؟",
    {
      "يوم السبت.": false,
      "يوم الجمعة.": false,
      "يوم الاحد.": true,
      "يوم الخميس.": false,
    },
  ),
  QuestionModel("ما هو اسم العبد الصالح الذي رافقه نبي الله موسى عليه السلام؟", {
    "العزيز": false,
    "عمر": false,
    "داوود": false,
    "الخضر": true,
  }),
  QuestionModel("ما هو عدد السجدات في القرآن الكريم ؟", {
    "14": false,
    "15": true,
    "12": false,
    "17": false,
  }),
  QuestionModel("من هو النبي الذي آمن به كل قومه؟", {
    "نوح عليه السلام.": false,
    "صالح عليه السلام.": false,
    "يونس عليه السلام.": true,
    "محمد صلى الله عليه وسلم.": false,
  }),
  QuestionModel("في أي يوم خُلق سيدنا آدم عليه السلام؟", {
    "يوم الجمعة.": true,
    "يوم الإثنين.": false,
    "يوم السبت.": false,
    "يوم الخميس.": false,
  }),
  QuestionModel("ما هي مهنة سيدنا محمد صلى الله عليه وسلم قبل أن يكون رسول الله؟", {
    "الصيد .": false,
    "الحدادة والنجارة.": false,
    "رعي الأغنام والتجارة.": true,
    "رعي الأغنام.": false,
  }),
  QuestionModel(
      "ما هو عمر الرسول محمد صلى الله عليه وسلم عندما تلقى الوحي من الله؟ ", {
    "35 عاما.": false,
    "45 عاما.": false,
    "39 عاما.": false,
    "40 عاما.": true,
  }),
  QuestionModel("كم أنجب الرسول صل الله علية وسلم من الأبناء؟", {
    "6 أبناء.": false,
    "5أبناء.": false,
    "7 أبناء.": true,
    "10 أبناء.": false,
  }),
  QuestionModel(
      "من هو النبي الذي اختصه الله عز وجل بقتل المسيح الدجال في آخر الزمان بعد فتنة البشر به؟",
      {
        "سيدنا إبراهيم عليه السلام.": false,
        "سيدنا محمد صلي الله علية وسلم.": false,
        "سيدنا عيسى عليه السلام.": true,
        "سيدنا سليمان عليه السلام.": false,
      }),
  QuestionModel(
      "ما هي السورة الوحيدة في القرآن الكريم التي لا تحتوي على حرف الميم؟", {
    "سورة النصر.": false,
    "سورة الكوثر.": true,
    "سورة الإخلاص.": false,
    "سورة الفيل.": false,
  }),
];
